InformationRegisters/БлокировкиБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>БлокировкиБаз</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияБлокировокБаз</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗавершениеРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>База</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Базы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияБлокировокБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>СостоянияБлокировокБаз</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Захвачена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Свободна</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/БлокировкиБаз/Ext/ManagerModule.bsl
&НаСервере
Процедура ЗаписатьДействие(База, Пользователь, Дата = Неопределено) Экспорт 
	Менеджер = РегистрыСведений.БлокировкиБаз.СоздатьМенеджерЗаписи();
	Менеджер.База = База;
	Менеджер.Пользователь = Пользователь;
	Если Дата = Неопределено Тогда
		Менеджер.Состояние = Перечисления.СостоянияБлокировокБаз.Захвачена;
		Менеджер.Период = ТекущаяДата();
		Менеджер.Записать();
	Иначе 
		Менеджер.Состояние = Перечисления.СостоянияБлокировокБаз.Свободна;
		Менеджер.ЗавершениеРаботы = ТекущаяДата();
		Менеджер.Период = Дата; 
		Менеджер.Записать();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция БазаЗахвачена(База, Инфо = "") Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	БлокировкиБазСрезПоследних.Период,
	               |	БлокировкиБазСрезПоследних.Пользователь
	               |ИЗ
	               |	РегистрСведений.БлокировкиБаз.СрезПоследних КАК БлокировкиБазСрезПоследних
	               |ГДЕ
	               |	БлокировкиБазСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияБлокировокБаз.Захвачена)
	               |	И БлокировкиБазСрезПоследних.База = &База";
	Запрос.УстановитьПараметр("База", База);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Инфо = "Конфигуратор базы " + База +  " занят пользователем " + Строка(Выборка.Пользователь);
		Возврат Истина; 
	Иначе
		Инфо = "Конфигуратор базы " + База + " свободен!";
		Возврат Ложь; 	
	КонецЕсли;
КонецФункции

&НаСервере
Процедура СнятьБлокировку(База) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	БлокировкиБазСрезПоследних.Период,
	               |	БлокировкиБазСрезПоследних.Пользователь
	               |ИЗ
	               |	РегистрСведений.БлокировкиБаз.СрезПоследних КАК БлокировкиБазСрезПоследних
	               |ГДЕ
	               |	БлокировкиБазСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияБлокировокБаз.Захвачена)
	               |	И БлокировкиБазСрезПоследних.База = &База";
	Запрос.УстановитьПараметр("База", База);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		ЗаписатьДействие(База, ПараметрыСеанса.ТекущийПользователь, Выборка.Период);
	КонецЦикла;
	
КонецПроцедуры
